In [1]:
import numpy as np
import pandas as pd

In [5]:
date = pd.read_csv('C:\\Users\\EXCELL  COMPUTERS\\Programming_Data_Science\\CSV_Files\\Order.csv')

In [6]:
time = pd.read_csv('C:\\Users\\EXCELL  COMPUTERS\\Programming_Data_Science\\CSV_Files\\Message.csv')

In [7]:
date.head(3)

         date  product_id  city_id  orders
0  10/12/2019        7425       22       9
1    2/8/2019        2331       26      69
2   8/11/2019         582       26       3

In [8]:
time.head(3)

              date                                                msg
0    5/7/2014 0:28            ???????????? ? ???????? ??? ???.??? ???
1  11/30/2013 0:22              ???? ?????! ??? ?? ??? ???????? ?????
2   11/6/2013 0:26  ???????? ?33 ???? ? ?????? ???? ?????? ??? ???...

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        219 non-null    object
 1   product_id  219 non-null    int64
 2   city_id     219 non-null    int64
 3   orders      219 non-null    int64
dtypes: int64(3), object(1)
memory usage: 7.0+ KB

### Working with dates

In [10]:
#converting to date time datatypes

In [11]:
date['date'] = pd.to_datetime(date['date'])

In [12]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        219 non-null    datetime64[ns]
 1   product_id  219 non-null    int64
 2   city_id     219 non-null    int64
 3   orders      219 non-null    int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 7.0 KB

### Extract year

In [14]:
date['date_year'] = date['date'].dt.year
date.head(3)

        date  product_id  city_id  orders  date_year
0 2019-10-12        7425       22       9       2019
1 2019-02-08        2331       26      69       2019
2 2019-08-11         582       26       3       2019

### Extract month

In [15]:
date['month'] = date['date'].dt.month

In [16]:
date.head(3)

        date  product_id  city_id  orders  date_year  month
0 2019-10-12        7425       22       9       2019     10
1 2019-02-08        2331       26      69       2019      2
2 2019-08-11         582       26       3       2019      8

### Extract month name

In [17]:
date['month_name'] = date['date'].dt.month_name()

In [18]:
date.head(2)

        date  product_id  city_id  orders  date_year  month month_name
0 2019-10-12        7425       22       9       2019     10    October
1 2019-02-08        2331       26      69       2019      2   February

### Extract days

In [19]:
date['days'] = date['date'].dt.day

In [20]:
date.head(2)

        date  product_id  city_id  orders  date_year  month month_name  days
0 2019-10-12        7425       22       9       2019     10    October    12
1 2019-02-08        2331       26      69       2019      2   February     8

### Day of week

In [21]:
date['Day_of_week'] = date['date'].dt.dayofweek
date.head(3)

,date,product_id,city_id,orders,date_year,month,month_name,days,Day_of_week
0,2019-10-12,7425,22,9,2019,10,October,12,5
1,2019-02-08,2331,26,69,2019,2,February,8,4
2,2019-08-11,582,26,3,2019,8,August,11,6

### Day of week name

In [22]:
date['Day_week_name'] = date['date'].dt.day_name()

In [23]:
date.head(2)

,date,product_id,city_id,orders,date_year,month,month_name,days,Day_of_week,Day_week_name
0,2019-10-12,7425,22,9,2019,10,October,12,5,Saturday
1,2019-02-08,2331,26,69,2019,2,February,8,4,Friday

### Extract week of the year

In [24]:
date['date_week'] = date['date'].dt.week
date.head(2)

C:\Users\EXCELL  COMPUTERS\AppData\Local\Temp\ipykernel_11864\3715582761.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

,date,product_id,city_id,orders,date_year,month,month_name,days,Day_of_week,Day_week_name,date_week
0,2019-10-12,7425,22,9,2019,10,October,12,5,Saturday,41
1,2019-02-08,2331,26,69,2019,2,February,8,4,Friday,6

### Extract quarter

In [25]:
date['quarter'] = date['date'].dt.quarter

In [26]:
date.head(3)

,date,product_id,city_id,orders,date_year,month,month_name,days,Day_of_week,Day_week_name,date_week,quarter
0,2019-10-12,7425,22,9,2019,10,October,12,5,Saturday,41,4
1,2019-02-08,2331,26,69,2019,2,February,8,4,Friday,6,1
2,2019-08-11,582,26,3,2019,8,August,11,6,Sunday,32,3

### Extract semester

In [27]:
date['semester'] = np.where(date['quarter'].isin([1,2]) ,1, 2)
date.head(3)

,date,product_id,city_id,orders,date_year,month,month_name,days,Day_of_week,Day_week_name,date_week,quarter,semester
0,2019-10-12,7425,22,9,2019,10,October,12,5,Saturday,41,4,2
1,2019-02-08,2331,26,69,2019,2,February,8,4,Friday,6,1,1
2,2019-08-11,582,26,3,2019,8,August,11,6,Sunday,32,3,2

### Extract time elapsed between dates

In [28]:
import datetime

In [32]:
today = datetime.datetime.today()
today.isocalendar
today

datetime.datetime(2023, 10, 6, 8, 48, 40, 425223)

In [33]:
today - date['date']

0     1455 days 08:48:40.425223
1     1701 days 08:48:40.425223
2     1517 days 08:48:40.425223
3     1429 days 08:48:40.425223
4     1408 days 08:48:40.425223
                 ...
214   1824 days 08:48:40.425223
215   1765 days 08:48:40.425223
216   1613 days 08:48:40.425223
217   1678 days 08:48:40.425223
218   1452 days 08:48:40.425223
Name: date, Length: 219, dtype: timedelta64[ns]

### Working with time data

In [34]:
#converting the datatype

In [35]:
time['date'] = pd.to_datetime(time['date'])

In [36]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219 entries, 0 to 218
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    219 non-null    datetime64[ns]
 1   msg     219 non-null    object
dtypes: datetime64[ns](1), object(1)
memory usage: 3.5+ KB

### extract time part

In [37]:
time['time'] = time['date'].dt.time

time.head(3)

,date,msg,time
0,2014-05-07 00:28:00,???????????? ? ???????? ??? ???.??? ???,00:28:00
1,2013-11-30 00:22:00,???? ?????! ??? ?? ??? ???????? ?????,00:22:00
2,2013-11-06 00:26:00,???????? ?33 ???? ? ?????? ???? ?????? ??? ???...,00:26:00

### Extract hour minute second

In [39]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

In [41]:
time.sample(3)

,date,msg,time,hour,minute,second
136,2013-01-10 00:01:00,??????? ? ??? ??????? ?33???? ???? ??? ?????? ...,00:01:00,0,1,0
199,2013-03-16 00:42:00,???? ?? ?????!!!!!,00:42:00,0,42,0
89,2014-02-09 01:38:00,??? ??????? ?????????? ???????? ??????.,01:38:00,1,38,0

### Time difference

In [42]:
today - time['date']

0     3439 days 08:20:40.425223
1     3597 days 08:26:40.425223
2     3621 days 08:22:40.425223
3     3574 days 08:25:40.425223
4     4086 days 08:50:40.425223
                 ...
214   4221 days 07:58:40.425223
215   3542 days 09:34:40.425223
216   4007 days 09:11:40.425223
217   4123 days 09:14:40.425223
218   3395 days 09:23:40.425223
Name: date, Length: 219, dtype: timedelta64[ns]

In [43]:
#in second
(today - time['date'])/np.timedelta64(1,'s')

0      2.971596e+08
1      3.108112e+08
2      3.128846e+08
3      3.088239e+08
4      3.530622e+08
           ...
214    3.647231e+08
215    3.060633e+08
216    3.462379e+08
217    3.562605e+08
218    2.933618e+08
Name: date, Length: 219, dtype: float64

In [44]:
#in minute
(today - time['date'])/np.timedelta64(1,'m')

0      4.952661e+06
1      5.180187e+06
2      5.214743e+06
3      5.147066e+06
4      5.884371e+06
           ...
214    6.078719e+06
215    5.101055e+06
216    5.770632e+06
217    5.937675e+06
218    4.889364e+06
Name: date, Length: 219, dtype: float64

In [45]:
#in hour
(today - time['date'])/np.timedelta64(1,'h')

0       82544.344563
1       86336.444563
2       86912.377896
3       85784.427896
4       98072.844563
           ...
214    101311.977896
215     85017.577896
216     96177.194563
217     98961.244563
218     81489.394563
Name: date, Length: 219, dtype: float64